import { Controller, Inject } from "@nestjs/common";


@Controller()
export class DocumentController {

  constructor(
  ) {}
}

//TODO: нужно создать модуль для работы с документами
/*
документы можно загружать и получать
при загрузке документа создается запись в Postgres и Minio, также документ делится на страницы,
  на основе которых создаются узлы, на основе узлов создаются эмбеддинги и затем документ 
  сохраняется в Neo4j
при создании привязке документов к сообщению, документы в postgres привязываются к сообщению
есть 2 метода получения документа (2 кнопки на клиенте соответственно) - получение pdf и docx
при получении документа, получается запись из Postgres, затем из Minio по 
  полю <filetype>Filename получается файл и отправляется клиенту 
*/